<?php

/*
 * ----------------------------
 * 修改此配置会影响网站 国家所属仓库,对应关系
 * ----------------------------
 */
return [
    'related' => [
        //美国仓
        'US' => [
            'code' => ["US", "MX", "CA", "PR"],
            'id' => [38, 223, 138, 172]
        ],
        //澳洲仓
        'AU' => [
            'code' => ["AU", "NZ"],
            'id' => [13, 153]
        ],
        //德国仓
        'DE' => [
            'code' => ["BE", "GB", "FR", "DE", "IT", "NL", "LU", "DK", "IE", "ES", "GR", "PT", "AT", "SE", "FI", "MT",
                "CY", "PL", "HU", "CZ", "SK", "SI", "EE", "LV", "LT", "RO", "BG", "HR", "MC", 'IM',
                "IS", "BA", "RS", "ME", "MK", "AL", "MD", "NO", "CH", "AD", "LI", "SM", "JE", "FO", "GL",
                "GP", "GF", "MQ", "YT", "AW", "IC", 'GG', "VA"],
            'id' => [21, 222, 73, 81, 105, 150, 124, 57, 103, 195, 84, 171, 14, 203, 72, 132, 55,
                170, 97, 56, 189, 190, 67, 117, 123, 175, 33, 53, 141, 244,
                98, 27, 236, 242, 126, 2, 140, 160, 204, 5, 122, 182, 245, 70, 85, 87, 75, 134, 137, 12, 250, 243, 228]
        ],
        //新加坡仓
        'SG' => [
            'code' => ["SG", "KH", "LA", "MY", "TL", "ID", "BN", "MM", "PH", "TH", "VN"],
            'id' => [32, 100, 36, 116, 146, 129, 168, 188, 209, 61, 230]
        ],
        //国内仓
        'CN' => [
            'code' => [],
            'id' => []
        ],
    ],
    //当其国家匹配不到仓库时,默认匹配到国内仓
    'defaultWarehouse' => 'CN',

    //仓库切换开关
    'usWarehouseUp' => true
];
